Revit 2027 API
BuiltInFailures.SelectionFailures.NoElementSelected Property
 No element selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoElementSelected { get; }
Public Shared ReadOnly Property NoElementSelected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoElementSelected {
	FailureDefinitionId^ get ();
}
static member NoElementSelected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SelectionFailures Class
Autodesk.Revit.DB Namespace